In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__ #1

'1.1.2'

In [3]:
pd.show_versions() #1

INSTALLED VERSIONS
------------------
commit           : 2a7d3326dee660824a8433ffd01065f8ac37f7d6
python           : 3.8.2.final.0
python-bits      : 64
OS               : Darwin
OS-release       : 19.6.0
Version          : Darwin Kernel Version 19.6.0: Mon Aug 31 22:12:52 PDT 2020; root:xnu-6153.141.2~1/RELEASE_X86_64
machine          : x86_64
processor        : i386
byteorder        : little
LC_ALL           : None
LANG             : pl_PL.UTF-8
LOCALE           : pl_PL.UTF-8

pandas           : 1.1.2
numpy            : 1.18.4
pytz             : 2020.1
dateutil         : 2.8.1
pip              : 20.1.1
setuptools       : 46.4.0
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : 4.5.2
html5lib         : 1.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.2
IPython          : 7.16.1
pandas_datareader: 0.9.0
bs4              : 4.9.1
bottleneck       : None
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : 3.2.1
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 3.0.3
pandas_gbq       : None
pyarrow          : None
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.5.2
sqlalchemy       : 1.3.19
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : None
numba            : None

In [4]:
df = pd.DataFrame({'col one':[100, 200], 'col two':[300, 400]}) #2

In [5]:
df

   col one  col two
0      100      300
1      200      400

In [6]:
pd.DataFrame(np.random.rand(4, 8)) #2

,0,1,2,3,4,5,6,7
0,0.696341,0.683767,0.724591,0.099988,0.950682,0.956509,0.942649,0.688767
1,0.816737,0.020447,0.778340,0.245200,0.543091,0.661750,0.336542,0.090477
2,0.025083,0.108290,0.116294,0.123367,0.666171,0.583826,0.655836,0.210651
3,0.119040,0.257650,0.875033,0.118721,0.041683,0.730768,0.158170,0.966461

In [7]:
pd.DataFrame(np.random.rand(4, 8), columns=list('abcdefgh')) #2

,a,b,c,d,e,f,g,h
0,0.154834,0.756257,0.825081,0.097308,0.676107,0.462981,0.249365,0.680621
1,0.171911,0.030977,0.575924,0.165029,0.378728,0.968384,0.723049,0.379098
2,0.088582,0.054387,0.185581,0.988816,0.212527,0.630471,0.405456,0.298757
3,0.215348,0.101659,0.027606,0.964826,0.309313,0.760186,0.492291,0.696399

In [8]:
df = df.rename({'col one':'col_one', 'col two': 'col_two'}, axis='columns')

In [9]:
df.columns = ['col_one', 'col_two'] #3

In [11]:
df.columns = df.columns.str.replace(' ', '_') #3

In [12]:
df.add_prefix('X_') #3

   X_col_one  X_col_two
0        100        300
1        200        400

In [13]:
df.add_prefix('_y') #3

   _ycol_one  _ycol_two
0        100        300
1        200        400

In [ ]:
# reverse order 
#We can make reverse order by:
    df.loc[::-1].head()
#if we nedd change the index too
    df.loc[::-1].reset_index(drop=True).head()

In [ ]:
# reverse column order
# We can make that by 
    drinks.loc[:, ::-1].head()

In [ ]:
# Selected by data types
# We can make it by
drinks.select_dtypes(include='number').head()
# but we can use exclude too
drinks.select_dtypes(exclude='number').head()

In [14]:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                  'col_two':['4.4', '5.5', '6.6'],
                  'col_three':['7.7', '8.8', '-']})

In [15]:
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [16]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [17]:
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [18]:
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [19]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [20]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)

In [21]:
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

In [22]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

In [ ]:
# Reduce DataFrame size
small_drinks = pd.read_csv('htttp;//costam', usecols=cols)
dtypes = {'continent':'category'}

In [ ]:
# Build a DataFrame from multiplefiles
upload stocks1
upload stocks2
upload stocks3
from glob import glob
stock_files = sorted(glob('data/stocks*.csv'))
pd.concat((pd.read_csv(file) for file in stock_files, ignore_index=True))

If you need do the same with columns just put the argument axis='columns'

In [ ]:
# pd.read_clipboard() to do DataFrame from excel cliboard data

In [2]:
movies = pd.DataFrame(np.random.randn(10, 10))

In [3]:
movies

,0,1,2,3,4,5,6,7,8,9
0,-1.591962,1.026431,1.065151,-0.234690,0.342708,0.372342,0.000013,-0.487192,0.314036,-0.211767
1,-0.559446,-0.593093,0.281661,-0.485986,1.029102,0.414274,0.400526,-0.306763,0.120546,1.007410
2,-0.088438,0.364625,0.475812,-2.013928,-1.493004,-0.118641,-1.665734,1.609886,0.753453,-0.742931
3,1.342012,-0.514897,0.335882,0.308738,-0.506150,1.295821,1.934762,-1.320615,0.727512,-1.106981
4,1.090455,-1.546982,-3.039903,0.913934,-0.613597,-0.114308,-0.980814,-1.396799,-0.977266,-0.723016
5,-0.403033,-0.531469,-1.622522,-0.650580,1.361158,1.435627,-0.758620,0.760849,0.907551,-2.662672
6,0.494667,0.146500,0.749965,-0.421274,0.054189,0.355159,-0.419063,0.252625,0.891023,-1.546835
7,-0.220756,0.353916,-1.533537,-2.009885,-0.786501,0.295699,-1.350232,-0.525028,-0.887918,-1.412860
8,0.597021,0.633814,0.886471,1.406531,-0.640102,0.574685,0.023441,-0.278476,-0.243379,1.484475
9,-0.647234,0.265726,1.585650,0.061403,-0.326303,0.137849,0.071684,1.483921,-0.189930,0.655418

In [4]:
len(movies)

10

In [5]:
movies_1 = movies.sample(frac=0.75, random_state=1234) #split df 75 to 25%

In [7]:
movies_2 = movies.drop(movies_1.index)

In [9]:
len(movies_1) + len(movies_2)

10

In [10]:
movies_1.index.sort_values()

Int64Index([0, 1, 2, 4, 5, 7, 8, 9], dtype='int64')

In [12]:
movies_2.index.sort_values()

Int64Index([3, 6], dtype='int64')

In [13]:
# Filter a DataFrame by multiple categories

In [14]:
movies.genre.unique() # thats how we get an argument

AttributeError: 'DataFrame' object has no attribute 'genre'

In [ ]:
movies[(movies.genre == 'Action')|
      (movies.genre == 'Drama')|
      (movies.genre == 'Western')].head() # thats how we use them

In [ ]:
movies[~movies.genre.isin(['Action', 'Drama', 'Western'])].head()

In [ ]:
counts = movies.genre.value_counts() # Filter a DF by largest categories
counts

In [ ]:
counts.nlargest(3)

In [ ]:
counts.nlargest(3).index

In [ ]:
movies[movies.genre.isin(counts.nlargest(3).index)].head()

In [ ]:
#Handle missing values
ufo.head()
ufo.isna().sum()
ufo.isna().mean()
ufo.dropna(axis='columns').head()
ufo.dropna(thresh=len(ufo)*0.9, axis='columns').head()

In [15]:
# Split a string into multiple columns
df = pd.DataFrame({'name': ['John Arthur Doe', 'Jane Ann Smith'],
                  'location': ['Los Angeles, CA', 'Washington, DC']})

In [16]:
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [17]:
df[['first', 'middle', 'last']] = df.name.str.split(' ', expand=True)
df

              name         location first  middle   last
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith

In [18]:
df['city'] = df.location.str.split(', ', expand=True)[0]
df

              name         location first  middle   last         city
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe  Los Angeles
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith   Washington

In [19]:
# Expand a Series of lists into a DataFrame
df = pd.DataFrame({'col_one':['a', 'b', 'c'], 'col_two':[[10, 40], [20, 50], [30, 60]]})
df

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

In [20]:
df_new = df.col_two.apply(pd.Series)
df_new

    0   1
0  10  40
1  20  50
2  30  60

In [21]:
pd.concat([df, df_new], axis='columns')

  col_one   col_two   0   1
0       a  [10, 40]  10  40
1       b  [20, 50]  20  50
2       c  [30, 60]  30  60

In [ ]:
# Aggregate by multiple functions
orders.head(10)
orders[orders.order_id == 1].item_price.sum()
orders.groupby('order_id').item_price.sum().head()
orders.groupby('order_id').item_price.agg(['sum', 'count']).head()

In [ ]:
# Combine the output of an aggregation with a DataFrame
total_price = orders.groupby('order_id').item_price.transform('sum')
len(total_price)
orders['total_price'] = total_price
order['percent_of_total'] = orders.item_price / orders.total_price

In [ ]:
# Select a slice of row and columns

titanic.describe()
titanic.describe().loc['min':'max']
titanic.describe().loc['min':'max', 'Pclass':'Parch']

In [ ]:
# Reshape the multiindexed Series
titanic.Survived.mean()
titanic.groupby('Sex')
titanic.groupby(['Sex', 'Pclass']).survived.mean()
titanic.groupby(['Sex', 'Pclass']).survived.mean().unstack()

In [ ]:
# Create a pivot Table, the same result like upper
titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='mean',
                   margins=True)
titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='count',
                   margins=True)

In [ ]:
# Convert continous data into categorical data
pd.cut(titanic.AGe, bins=[0, 18, 25, 99], labels=['child', 'young adult', 'adult']).head(10)

In [ ]:
# change display options

pd.set_option('display.float_format', '{:.2f}'.format)

In [ ]:
# Style a DataFrame
format_dict = {'Date':'{:%m/%d/%y', 'Close':'${:.2f}', 'Volume':'{:,}'}}

In [ ]:
stocks.style.format(format_dict)

(stocks.style.format(format_dict)
.hide_index()
.highlight_min('Close', color='red')
.highlight_max('Close', color='lightgreen')
)

In [ ]:
(stocks.style.format(format_dict)
.hide_index()
.background_gradient(subset='Volume', cmap='Blues')
)

In [ ]:
# profile a DataFrame
import pandas_profiling
pandas_profiling.ProfileReport(titanic)